In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('product.csv')

In [3]:
data.shape

(150150, 9)

In [4]:
data.head(5)

,record_ID,week,store_id,sku_id,total_price,base_price,is_featured_sku,is_display_sku,units_sold
0,1.0,17-01-2011,8091.0,216418.0,99.0375,111.8625,0.0,0.0,20.0
1,2.0,17-01-2011,8091.0,216419.0,99.0375,99.0375,0.0,0.0,28.0
2,3.0,17-01-2011,8091.0,216425.0,133.9500,133.9500,0.0,0.0,19.0
3,4.0,17-01-2011,8091.0,216233.0,133.9500,133.9500,0.0,0.0,44.0
4,5.0,17-01-2011,8091.0,217390.0,141.0750,141.0750,0.0,0.0,52.0

In [5]:
data.tail(5)

,record_ID,week,store_id,sku_id,total_price,base_price,is_featured_sku,is_display_sku,units_sold
150145,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
150146,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
150147,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
150148,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
150149,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
data.dtypes

record_ID          float64
week                object
store_id           float64
sku_id             float64
total_price        float64
base_price         float64
is_featured_sku    float64
is_display_sku     float64
units_sold         float64
dtype: object

In [8]:
data['week'].unique()

array(['17-01-2011', '24-01-2011', '31-01-2011', '07-02-2011',
       '14-02-2011', '21-02-2011', '28-02-2011', '07-03-2011',
       '14-03-2011', '21-03-2011', '28-03-2011', '04-04-2011',
       '11-04-2011', '18-04-2011', '25-04-2011', '02-05-2011',
       '09-05-2011', '16-05-2011', '23-05-2011', '30-05-2011',
       '06-06-2011', '13-06-2011', '20-06-2011', '27-06-2011',
       '04-07-2011', '11-07-2011', '18-07-2011', '25-07-2011',
       '01-08-2011', '08-08-2011', '15-08-2011', '22-08-2011',
       '29-08-2011', '05-09-2011', '12-09-2011', '19-09-2011',
       '26-09-2011', '03-10-2011', '10-10-2011', '17-10-2011',
       '24-10-2011', '31-10-2011', '07-11-2011', '14-11-2011',
       '21-11-2011', '28-11-2011', '05-12-2011', '12-12-2011',
       '19-12-2011', '26-12-2011', '02-01-2012', '09-01-2012',
       '16-01-2012', '23-01-2012', '30-01-2012', '06-02-2012',
       '13-02-2012', '20-02-2012', '27-02-2012', '06-03-2012',
       '13-03-2012', '20-03-2012', '27-03-2012', '03-04-2012',
       '10-04-2012', '17-04-2012', '24-04-2012', '01-05-2012',
       '08-05-2012', '15-05-2012', '22-05-2012', '29-05-2012',
       '05-06-2012', '12-06-2012', '19-06-2012', '26-06-2012',
       '03-07-2012', '10-07-2012', '17-07-2012', '24-07-2012',
       '31-07-2012', '07-08-2012', '14-08-2012', '21-08-2012',
       '28-08-2012', '04-09-2012', '11-09-2012', '18-09-2012',
       '25-09-2012', '02-10-2012', '09-10-2012', '16-10-2012',
       '23-10-2012', '30-10-2012', '06-11-2012', '13-11-2012',
       '20-11-2012', '27-11-2012', '04-12-2012', '11-12-2012',
       '18-12-2012', '25-12-2012', '01-01-2013', '08-01-2013',
       '15-01-2013', '22-01-2013', '29-01-2013', '05-02-2013',
       '12-02-2013', '19-02-2013', '26-02-2013', '05-03-2013',
       '12-03-2013', '19-03-2013', '26-03-2013', '02-04-2013',
       '09-04-2013', '16-04-2013', '23-04-2013', '30-04-2013',
       '07-05-2013', '14-05-2013', '21-05-2013', '28-05-2013',
       '04-06-2013', '11-06-2013', nan], dtype=object)

In [9]:
data['week'].nunique()

126

In [10]:
data['week'].value_counts()

17-01-2011    1155
24-07-2012    1155
23-10-2012    1155
16-10-2012    1155
09-10-2012    1155
              ...
03-10-2011    1155
26-09-2011    1155
19-09-2011    1155
12-09-2011    1155
11-06-2013    1155
Name: week, Length: 126, dtype: int64